// ============================================================================
// 
// HTML リスト出力クラス
// 
// ============================================================================

// ----------------------------------------------------------------------------
// 
// ----------------------------------------------------------------------------

using Shinta;
using System;

namespace YukaLister.Shared
{
	// ====================================================================
	// HTML リスト出力クラス
	// ====================================================================

	public class HtmlOutputWriter : WebOutputWriter
	{
		// ====================================================================
		// コンストラクター・デストラクター
		// ====================================================================

		// --------------------------------------------------------------------
		// コンストラクター
		// --------------------------------------------------------------------
		public HtmlOutputWriter()
		{
			// プロパティー
			FormatName = "HTML";
			TopFileName = "index" + Common.FILE_EXT_HTML;
			OutputSettings = new HtmlOutputSettings();

			// メンバー変数
			mListExt = Common.FILE_EXT_HTML;
			mDirectoryTopName = "曲一覧";
			mDirectoryTopLink = "<a href=\"" + TopFileName + "\">" + mDirectoryTopName + "</a>";
			mAdditionalDescription = null;
			mAdditionalHeader = null;
			mAdditionalNavi = null;
			mListLinkArg = null;
		}

		// ====================================================================
		// protected メンバー関数
		// ====================================================================

		// --------------------------------------------------------------------
		// リストに出力するファイル名の表現
		// --------------------------------------------------------------------
		protected override String FileNameDescription(String oFileName)
		{
			return oFileName;
		}

	}
}
