// ============================================================================
// 
// HTML リスト出力設定クラス
// 
// ============================================================================

// ----------------------------------------------------------------------------
// 
// ----------------------------------------------------------------------------

using Shinta;

namespace YukaLister.Shared
{
	public class HtmlOutputSettings : WebOutputSettings
	{
	}
	// public class HtmlOutputSettings ___END___

}
// namespace YukaLister.Shared ___END___
