// ============================================================================
// 
// ゆかり用リスト出力設定クラス
// 
// ============================================================================

// ----------------------------------------------------------------------------
// 
// ----------------------------------------------------------------------------

using Shinta;

namespace YukaLister.Shared
{
	public class YukariOutputSettings : WebOutputSettings
	{
	}
	// public class YukariOutputSettings ___END___

}
// namespace YukaLister.Shared ___END___
